In [1]:
#importing libraries
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

#loading data
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset["train"].to_pandas()

#data cleanup
df["job_posted_date"] = pd.to_datetime(df["job_posted_date"])

First part of cleaning up the data is filling out the NAN values for yearly salary average and hourly average

In [3]:
median_salary_year = df["salary_year_avg"].median()

In [4]:
median_salary_hour = df["salary_hour_avg"].median()

In [8]:
#create new dataframe with some of the NAN values filled out 
df_filled = df

#fill out values for yearly salary average and hourly average
df_filled["salary_year_avg"] = df_filled["salary_year_avg"].fillna(median_salary_year)
df_filled["salary_hour_avg"] = df_filled["salary_hour_avg"].fillna(median_salary_hour)

In [11]:
df_filled.loc[:, "salary_year_avg": "salary_hour_avg"]

        salary_year_avg  salary_hour_avg
0              115000.0            45.98
1              115000.0            45.98
2              115000.0            45.98
3              115000.0            45.98
4              115000.0            45.98
...                 ...              ...
785736         115000.0            45.98
785737         115000.0            45.98
785738         115000.0            45.98
785739         115000.0            45.98
785740         115000.0            45.98

[785741 rows x 2 columns]

Next we are going to remove any duplicate job postings

In [13]:
df_unique = df_filled

df_unique = df_unique.drop_duplicates()

#debug printing to see how many rows were actually dropped

print("Length of original df: ", len(df_filled))
print("Length of drop duplicates df: ", len(df_unique))
print("Rows Dropped: ", len(df_filled) - len(df_unique))

Length of original df:  785741
Length of drop duplicates df:  785640
Rows Dropped:  101

We are going to filter out even more duplicates by specifying repeat job postings from the same company

In [14]:
df_unique = df_unique.drop_duplicates(subset=["job_title", "company_name"])

#debug printing to see how many rows were actually dropped

print("Length of original df: ", len(df_filled))
print("Length of drop duplicates df: ", len(df_unique))
print("Rows Dropped: ", len(df_filled) - len(df_unique))

Length of original df:  785741
Length of drop duplicates df:  508042
Rows Dropped:  277699